In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [4]:
dict1={'Names':['Yashwant','Mokshita',np.nan,'Madhuri','Tanisha'],
        'Age':[np.nan,14,13,17,11],
        'City':['Delhi','Blr','Pune','Glr',np.nan]}
dict1

{'Names': ['Yashwant', 'Mokshita', nan, 'Madhuri', 'Tanisha'],
 'Age': [nan, 14, 13, 17, 11],
 'City': ['Delhi', 'Blr', 'Pune', 'Glr', nan]}

In [5]:
pd.DataFrame(dict1)

      Names   Age   City
0  Yashwant   NaN  Delhi
1  Mokshita  14.0    Blr
2       NaN  13.0   Pune
3   Madhuri  17.0    Glr
4   Tanisha  11.0    NaN

In [6]:
d1=pd.DataFrame(dict1)

In [7]:
d1.dtypes

Names     object
Age      float64
City      object
dtype: object

In [9]:
dict2={'Names':['Yashwant','Mokshita',None,'Madhuri','Tanisha'],
        'Age':[np.nan,14,13,17,11],
        'City':['Delhi','Blr','Pune','Glr',None]}
pd.DataFrame(dict2)

      Names   Age   City
0  Yashwant   NaN  Delhi
1  Mokshita  14.0    Blr
2      None  13.0   Pune
3   Madhuri  17.0    Glr
4   Tanisha  11.0   None

In [10]:
d1.isnull()

   Names    Age   City
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False  False
4  False  False   True

In [11]:
d1.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [12]:
d1.isnull().sum()*100/len(d1)

Names    20.0
Age      20.0
City     20.0
dtype: float64

- np.nan: not a number this applicable for numerical columns only

- Generally data has some empty rows

- It is a data problem

- If you read that kind of data you will see null

- You need to understand it is a data corrupted or really Null values are there

**Method-1**

**Fill with some random values**

**Method name**: fill na

In [13]:
d1.fillna(40)

      Names   Age   City
0  Yashwant  40.0  Delhi
1  Mokshita  14.0    Blr
2        40  13.0   Pune
3   Madhuri  17.0    Glr
4   Tanisha  11.0     40

**Method-2**

- We can fill the values w.r.t. columns also

In [17]:
d1['Age'].fillna(40)

# it is not updated
# inplace= False

0    40.0
1    14.0
2    13.0
3    17.0
4    11.0
Name: Age, dtype: float64

In [16]:
d1

      Names   Age   City
0  Yashwant   NaN  Delhi
1  Mokshita  14.0    Blr
2       NaN  13.0   Pune
3   Madhuri  17.0    Glr
4   Tanisha  11.0    NaN

In [18]:
d1['Age'].fillna(40,inplace=True)

In [19]:
d1

      Names   Age   City
0  Yashwant  40.0  Delhi
1  Mokshita  14.0    Blr
2       NaN  13.0   Pune
3   Madhuri  17.0    Glr
4   Tanisha  11.0    NaN

In [20]:
dict1={'Names':['Yashwant','Mokshita',np.nan,'Madhuri','Tanisha'],
        'Age':[np.nan,14,13,17,11],
        'City':['Delhi','Blr','Pune','Glr',np.nan]}
d1=pd.DataFrame(dict1)

**Method-3**

- bfill

- ffill

- pad

- backfill

In [24]:
d1.fillna(method='bfill')
# It will fill with below value or next value
# Column1: Names index 3 is missing values it is filled with index4 values
# Column2: Age index 1 is missing it is filled with index 2 values
# Column3: City index 5 is missing it should be filled with next values but we don't have next values

C:\Users\HP\AppData\Local\Temp\ipykernel_7984\927219379.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill')

      Names   Age   City
0  Yashwant  14.0  Delhi
1  Mokshita  14.0    Blr
2   Madhuri  13.0   Pune
3   Madhuri  17.0    Glr
4   Tanisha  11.0    NaN

In [26]:
d1.fillna(method='bfill',axis=1)
# axis=1 means columns 
# Nan values fill with next column values

C:\Users\HP\AppData\Local\Temp\ipykernel_7984\2150281777.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill',axis=1)

      Names    Age   City
0  Yashwant  Delhi  Delhi
1  Mokshita   14.0    Blr
2      13.0   13.0   Pune
3   Madhuri   17.0    Glr
4   Tanisha   11.0    NaN

In [27]:
d1.fillna(method='backfill')

C:\Users\HP\AppData\Local\Temp\ipykernel_7984\907203477.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='backfill')

      Names   Age   City
0  Yashwant  14.0  Delhi
1  Mokshita  14.0    Blr
2   Madhuri  13.0   Pune
3   Madhuri  17.0    Glr
4   Tanisha  11.0    NaN

In [28]:
d1.fillna(method='pad')

C:\Users\HP\AppData\Local\Temp\ipykernel_7984\3282249208.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='pad')

      Names   Age   City
0  Yashwant   NaN  Delhi
1  Mokshita  14.0    Blr
2  Mokshita  13.0   Pune
3   Madhuri  17.0    Glr
4   Tanisha  11.0    Glr

In [29]:
d1.fillna(method='ffill')

C:\Users\HP\AppData\Local\Temp\ipykernel_7984\4088926743.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='ffill')

      Names   Age   City
0  Yashwant   NaN  Delhi
1  Mokshita  14.0    Blr
2  Mokshita  13.0   Pune
3   Madhuri  17.0    Glr
4   Tanisha  11.0    Glr

- backfill and bfill fill with Next value

- pad and ffill fill with previous value

- but it will change based on axis

**Method-4**

- mean

    - Numerical values can fill with mean values

    - but mean affect by outliers

    - if we don't have outliers it is best one

- median

   - Numerical values can fill with median values

   - We know that median values does not affect with outliers

   - so if outliers are there we can go with median

- mode

   - Mode is useful for categorical data

In [32]:
dict1={'Names':['Yashwant','Mokshita',np.nan,'Madhuri','Tanisha'],
        'Age':[np.nan,14,13,17,11],
        'City':['Delhi','Blr','Pune','Glr',np.nan]}
d1=pd.DataFrame(dict1)
d1

      Names   Age   City
0  Yashwant   NaN  Delhi
1  Mokshita  14.0    Blr
2       NaN  13.0   Pune
3   Madhuri  17.0    Glr
4   Tanisha  11.0    NaN

In [31]:
# we already know we can fill with some values based on specific columns using frame 
# d1.fillna(<random number>)
# d1 represents all the columns
age_mean=d1['Age'].mean()
d1['Age'].fillna(age_mean)

0    13.75
1    14.00
2    13.00
3    17.00
4    11.00
Name: Age, dtype: float64

In [33]:
age_median=d1['Age'].median()
d1['Age'].fillna(age_median)

0    13.5
1    14.0
2    13.0
3    17.0
4    11.0
Name: Age, dtype: float64

In [34]:
age_mode=d1['Age'].mode()
d1['Age'].fillna(age_mode)

0    11.0
1    14.0
2    13.0
3    17.0
4    11.0
Name: Age, dtype: float64

In [35]:
d1

      Names   Age   City
0  Yashwant   NaN  Delhi
1  Mokshita  14.0    Blr
2       NaN  13.0   Pune
3   Madhuri  17.0    Glr
4   Tanisha  11.0    NaN

In [36]:
d1['City'].mode()
# In this use case we are getting mode equal
# But in real time we will get clear mode value

0      Blr
1    Delhi
2      Glr
3     Pune
Name: City, dtype: object

- Fill with random value

- Fill with random value on specific value

- Fill with methods

   - bfill

   - ffill

   - pad

   - backfill

- Fill with

   - Mean

   - Median

   - Mode

**Method-5**

**KNN imputer**

- KNN: k nearest Neighbours

- K is a hyper parameter means user can choose

- It is a distance metric: **Euclidian distance**

- KNN imputer will take the mean of the neighbours value

- The neighbours value can provided by using value=k

- It is under sklearn package

- Under sklearn we have Imputer method

- Under imputer method we have KnnImputer

- Applicable only for Numerical data

<img id="dimg_27" src="" class="YQ4gaf" height="203" style="object-position:41% 16%" width="248" alt="Distance Measures in Machine Learning ..." data-csiid="26" data-atf="1">

In [38]:
from sklearn.impute import KNNImputer
KI=KNNImputer()
KI.fit_transform(d1[['Age']])

array([[13.75],
       [14.  ],
       [13.  ],
       [17.  ],
       [11.  ]])